# Brewfile
tap "omuomugin/tap"
tap "knqyf263/pet"
tap "dart-lang/dart"

brew "java"
brew "curl"
brew "docker"
brew "fzf"
brew "ghq"
brew "go"
brew "dart"
brew "graphviz"
brew "httpie"
brew "jq"
brew "jnv"
brew "yq"
brew "mysql"
brew "nodenv"
brew "peco"
brew "plantuml"
brew "postgresql"
brew "rbenv"
brew "redis"
brew "sbt"
brew "tree"
brew "yarn"
brew "gh"
brew "awscli"
brew "k6"
brew "terraform"
brew "pet"
brew "kubectx"
brew "git-who"

brew "zsh-completions"
brew "zsh-autosuggestions"

cask_args appdir: "/Applications"
cask "1password"
cask "raycast"
cask "docker"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "slack"
cask "visual-studio-code"
cask "zoom"
cask "monitorcontrol"
cask "ghostty"
