# tap
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "k1low/tap"
tap "knqyf263/pet"
tap "ktr0731/evans"
tap "omuomugin/tap"

# brew
brew "actionlint"
brew "awscli"
brew "curl"
brew "dart"
brew "deno"
brew "docker"
brew "duckdb"
brew "evans"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "go"
brew "graphviz"
brew "httpie"
brew "hugo"
brew "java"
brew "jnv"
brew "jq"
brew "kubectx"
brew "lcov"
brew "mysql"
brew "nodenv"
brew "openjdk"
brew "pandoc"
brew "peco"
brew "plantuml"
brew "postgresql"
brew "protobuf"
brew "rbenv"
brew "redis"
brew "ruby"
brew "sbt"
brew "starship"
brew "terraform"
brew "tesseract-lang"
brew "trafilatura"
brew "tree"
brew "yarn"
brew "yq"
brew "zsh-completions"
brew "zsh-autosuggestions"

brew "k1low/tap/octocov"
brew "k1low/tap/runn"

brew "knqyf263/pet/pet"

# apps
cask_args appdir: "/Applications"
cask "1password"
cask "ghostty"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "monitorcontrol"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "zoom"
