# Brewfile
tap "homebrew/cask"
tap "homebrew/core"
tap "omuomugin/tap"

brew "castit"
brew "curl"
brew "docker"
brew "fzf"
brew "ghq"
brew "go"
brew "graphviz"
brew "httpie"
brew "jq"
brew "mysql"
brew "nvm"
brew "peco"
brew "plantuml"
brew "postgresql"
brew "rbenv"
brew "redis"
brew "sbt"
brew "starship"
brew "tmux"
brew "tree"
brew "yarn"
brew "zsh-autosuggestions"

cask_args appdir: "/Applications"
cask "1password"
cask "alfred"
cask "docker"
cask "google-chrome"
cask "intellij-idea"
cask "karabiner-elements"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
